#pragma once

#define SLANDER_ARRAY			16
#define MAX_STRINGLEN			256
#define MAX_SLANDERLEN			32
static const char SLANDERWORD[SLANDER_ARRAY][2][MAX_SLANDERLEN] = 
{
	{{"승기님"},{"장군이 ㅠ0ㅠ"}},{{"재원님"},{"윤미야~ 따릉훼~"}},
	{{"동완님"},{"뻬에~"}},{{"정수님"},{"탐크루즈"}},
	{{"기남님"},{"고추총각.. >>ㅑ~~ ♡"}},{{"주혜님"},{"비비탄 리"}},
	{{"준호님"},{"타로오옹~"}},{{"상훈님"},{"정.신.마.비"}},
	{{"현석님"},{"B!!"}},{{"소진님"},{"얘기아빠"}},
	{{"현주님"},{"시골아줌C"}},{{"은지님"},{"서울소"}},
	{{""},{"-"}},{{"팀장님"},{"메ㅡㅠㅡ덩"}},

/*
	{{"개넘"},{"나쁜애"}},{{"젓나"},{"매우"}},
	{{"전나구려"},{"매우이상"}},{{"전나"},{"매우"}},
	{{"이시끼"},{"이녀석"}},{{"개새끼"},{"나쁜애"}},
	{{"존나게"},{"많이"}},{{"전나게"},{"아주"}},
	{{"존나"},{"매우"}},{{"졸라"},{"매우"}},
	{{"씨발"},{"저런"}},{{"띠발"},{"좋아"}},
	{{"자지"},{"저기"}},{{"보지"},{"거기"}},
	{{"씹"},{"그"}},{{"새끼"},{"아이"}},
	{{"쌔끼"},{"아이"}},{{"때끼"},{"애"}},
	{{"섹스"},{"응응"}},{{"죽어"},{"그만해"}},
	{{"뒤져"},{"그만해"}},{{"지랄"},{"심"}},
	{{"당근이지"},{"당연하지"}},{{"말밥"},{"당연"}},
	{{"직딩"},{"직장인"}},{{"고딩어"},{"고등학생이"}},
	{{"고딩"},{"고등학생"}},{{"중딩"},{"중학생"}},
	{{"까대"},{"떠드"}},{{"까댄"},{"떠든"}},
	{{"니미"},{"에이"}},{{"닝기미"},{"에이"}},
	{{"짜져"},{"사라져"}},{{"좆밥"},{"만만"}},
	{{"애비"},{"아빠"}},{{"애미"},{"엄마"}},
	{{"젖밥"},{"만만"}},{{"뻘쭘"},{"어색"}},
	{{"뽀작"},{"끝장"}},{{"아작"},{"끝장"}},
	{{"허접"},{"후진"}},{{"젓밥"},{"만만"}}, 
	{{"썅"},{"저런"}},{{"씹"},{"거기"}},
	{{"좃"},{"저기"}},{{"좆"},{"저기"}},
	{{"좇"},{"저기"}},{{"조까"},{"저런"}},
	{{"저까"},{"저런"}},{{"쪼까튼"},{"안좋은"}},
	{{"젓같은"},{"안좋은"}},{{"젓가튼"},{"안좋은"}},
	{{"지랄"},{"이런"}},{{"찌랄"},{"이런"}},
	{{"개새"},{"나쁜"}},{{"개보지"},{"나쁜"}},
	{{"애미보지"},{"나쁜"}},{{"개세"},{"나쁜"}},
	{{"개쉐"},{"나쁜"}},{{"개자"},{"나쁜"}},
	{{"십새"},{"나쁜"}},{{"십쉐"},{"나쁜"}},
	{{"씹새"},{"나쁜"}},{{"씹쉐"},{"나쁜"}},
	{{"십때끼"},{"나쁜애"}},{{"십떼끼"},{"나쁜애"}},
	{{"띠발"},{"쩝"}},{{"띠방"},{"쩝"}},
	{{"띠벌"},{"쩝"}},{{"띠불"},{"쩝"}},
	{{"띠붕"},{"쩝"}},{{"띠팔"},{"쩝"}},
	{{"띠펄"},{"쩝"}},{{"띠풀"},{"쩝"}},
	{{"띠이발"},{"쩝"}},{{"띠이방"},{"쩝"}},
	{{"띠이벌"},{"쩝"}},{{"띠이불"},{"쩝"}},
	{{"띠이붕"},{"쩝"}},{{"띠이팔"},{"쩝"}},
	{{"띠이펄"},{"쩝"}},{{"띠이풀"},{"쩝"}},
	{{"시발"},{"쩝"}},{{"시벌"},{"쩝"}},
	{{"시불"},{"쩝"}},{{"시붕"},{"쩝"}},
	{{"시팔"},{"쩝"}},{{"시펄"},{"쩝"}},
	{{"시풀"},{"쩝"}},{{"시이발"},{"쩝"}},
	{{"시이벌"},{"쩝"}},{{"시이불"},{"쩝"}},
	{{"시이붕"},{"쩝"}},{{"시이팔"},{"쩝"}},
	{{"시이펄"},{"쩝"}},{{"시이풀"},{"쩝"}},
	{{"쉬발"},{"쩝"}},{{"쉬방"},{"쩝"}},
	{{"쉬벌"},{"쩝"}},{{"쉬불"},{"쩝"}},
	{{"쉬붕"},{"쩝"}},{{"쉬빨"},{"쩝"}},
	{{"쉬팔"},{"쩝"}},{{"쉬펄"},{"쩝"}},
	{{"쉬풀"},{"쩝"}},{{"쉬이발"},{"쩝"}},
	{{"쉬이방"},{"쩝"}},{{"쉬이벌"},{"쩝"}},
	{{"쉬이불"},{"쩝"}},{{"쉬이붕"},{"쩝"}},
	{{"쉬이빨"},{"쩝"}},{{"쉬이팔"},{"쩝"}},
	{{"쉬이펄"},{"쩝"}},{{"쉬이풀"},{"쩝"}},
	{{"씨발"},{"쩝"}},{{"씨방"},{"쩝"}},
	{{"씨벌"},{"쩝"}},{{"씨불"},{"쩝"}},
	{{"씨붕"},{"쩝"}},{{"씨빨"},{"쩝"}},
	{{"씨팔"},{"쩝"}},{{"씨펄"},{"쩝"}},
	{{"씨풀"},{"쩝"}},{{"쓰벌"},{"쩝"}},
	{{"쓰불"},{"쩝"}},{{"쓰으벌"},{"쩝"}},
	{{"씨이발"},{"쩝"}},{{"씨이방"},{"쩝"}},
	{{"씨이벌"},{"쩝"}},{{"씨이불"},{"쩝"}},
	{{"씨이붕"},{"쩝"}},{{"씨이빨"},{"쩝"}},
	{{"씨이팔"},{"쩝"}},{{"씨이펄"},{"쩝"}},
	{{"씨이풀"},{"쩝"}},{{"쒸발"},{"쩝"}},
	{{"쒸방"},{"쩝"}},{{"쒸벌"},{"쩝"}},
	{{"쒸불"},{"쩝"}},{{"쒸붕"},{"쩝"}},
	{{"쒸빨"},{"쩝"}},{{"쒸팔"},{"쩝"}},
	{{"쒸펄"},{"쩝"}},{{"쒸풀"},{"쩝"}},
	{{"쒸이발"},{"쩝"}},{{"쒸이방"},{"쩝"}},
	{{"쒸이벌"},{"쩝"}},{{"쒸이불"},{"쩝"}},
	{{"쒸이붕"},{"쩝"}},{{"쒸이빨"},{"쩝"}},
	{{"쒸이팔"},{"쩝"}},{{"쒸이펄"},{"쩝"}},
	{{"쒸이풀"},{"쩝"}},{{"새끼"},{"아이"}},
	{{"새꺄"},{"아이"}},{{"세끼"},{"아이"}},
	{{"색끼"},{"아이"}},{{"섹스"},{"응응"}},
	{{"색스"},{"응응"}},{{"색스"},{"쩝"}},
	{{"쌕쓰"},{"응응"}},{{"섹쓰"},{"응응"}},
	{{"병신"},{"이런"}},{{"개놈"},{"아이"}},
	{{"개년"},{"아이"}},{{"개쉐리"},{"아이"}},
	{{"개쒜리"},{"아이"}},{{"미친놈"},{"나쁜애"}},
	{{"미췬놈"},{"나쁜애"}},{{"미친년"},{"나쁜애"}},
	{{"미췬년"},{"나쁜애"}},{{"쌍년"},{"나쁜애"}},
	{{"쌍넌"},{"나쁜애"}},{{"창녀"},{"나쁜애"}},
	{{"니기미"},{"이런"}},{{"닝기미"},{"이런"}},
	{{"애자"},{"친구"}},{{"ㅇㅐ자"},{"친구"}},
	{{"ㅇㅐㅈㅏ"},{"친구"}},{{"ㅇ ㅐ자"},{"친구"}},
	{{""},{"-"}},{{""},{"-"}},
	{{""},{"-"}},{{""},{"-"}},
	{{""},{"-"}},{{""},{"-"}},
	{{""},{"-"}},{{""},{"-"}}
/**/
};


static void ToUpper( char* szString )
{
	char		szBuff[MAX_STRINGLEN] = {0,};
	char		szTmpBuff[MAX_STRINGLEN] = {0,};
	int			nInputStrLen = strlen( szString );
	char*	pString = szString;

	for( int i = 0; i < nInputStrLen; )
	{
		if( *pString < 0 && *pString >= (char)(0x80) )
		{
			// check double character
			i += 2;
		}
		else
		{
			i++;
				// change to upper
			if( islower( *pString ) )
				*pString = _toupper( *pString );
		}

		pString = szString + i;
	}
}

static bool SliceSlander( char* szString )
{
	char szBuff[MAX_STRINGLEN] = {0,};
	char szTmpBuff[MAX_STRINGLEN] = {0,};
	int		nInputStrLen = strlen( szString );
	int		nSlanderLen;

	bool bIsKorean = false;
	bool bIsFound = false;
	char* pString = szString;
	for( int i=0; i<nInputStrLen; )
	{
		if( *pString < 0 && *pString >= (char)(0x80) )	bIsKorean = true;
		else											bIsKorean = false;
		
		bIsFound = false;
		for( int j=0; j<SLANDER_ARRAY; ++j )
		{
			nSlanderLen = strlen( SLANDERWORD[j][0] );
			if( nSlanderLen == 0 )	break;
			
			ZeroMemory( szTmpBuff, MAX_STRINGLEN ) ;
			strcpy( szTmpBuff, pString ) ;
			ToUpper( szTmpBuff ) ;

			if( strncmp( szTmpBuff, SLANDERWORD[j][0], nSlanderLen ) )
			{
				continue;
			}
			else
			{
				bIsFound = true;
				strcat( szBuff, SLANDERWORD[j][1] );
				i += nSlanderLen;
				break;
			}
		}

		if( !bIsFound )
		{
			if( bIsKorean )	{	strncat( szBuff, pString, 2 );	i += 2;	}
			else					{	strncat( szBuff, pString, 1 );	i += 1;	}
		}

		pString = szString + i;
	}

	strcpy( szString, szBuff );

	return bIsFound;
}

static bool SlanderFilter( char* szString )
{
	if( SliceSlander( szString ) )
		return true;

	return false;
}
